//*************************************************************************************************
// 内容:	错误码(参考自SGDP::sdu::sderrno.h)
//---------------------------------------------------------
// 作者:	
// 创建:		2014-01-09
// 最后修改:	
//*************************************************************************************************
#pragma once
#ifndef _SD_BASE_DIAGNOSTICS_ERRNO_H__
#define _SD_BASE_DIAGNOSTICS_ERRNO_H__

BASE_NAMESPACE_BEGIN_BASE
BASE_NAMESPACE_BEGIN_DIAGNOSTICS
//-------------------------------------------------------------------------------------------------
void SDSetLastError(DWORD dwErrCode)
{
	::SetLastError(dwErrCode);
}
//-------------------------------------------------------------------------------------------------
DWORD SDGetLastError()
{
	return ::GetLastError();
}
//-------------------------------------------------------------------------------------------------
BASE_NAMESPACE_END_DIAGNOSTICS
BASE_NAMESPACE_END_BASE
#endif