//*************************************************************************************************
// 内容:	画布,描述一个画刷对象
//---------------------------------------------------------
// 作者:		
// 创建:		2012-09-03
// 最后修改:
//*************************************************************************************************
#pragma once
#ifndef _SD_GAMEEDITEX_EDITCANVAS_H__
#define _SD_GAMEEDITEX_EDITCANVAS_H__

SD_GAMEEDITEX_NAMESPACE_BEGIN_GAMEEDITEX
//-----------------------------------------------------------------------------
// 描述一个画刷对象
//-----------------------------------------------------------------------------
class sdEditCanvas : public NiRefObject
{
public:
	sdEditCanvas(){};
	virtual ~sdEditCanvas(){};
};
NiSmartPointer(sdEditCanvas);
//-----------------------------------------------------------------------------
SD_GAMEEDITEX_NAMESPACE_END_GAMEEDITEX
#endif